#!/bin/bash

echo "Найкоротші регулярні вирази, які будуть відповідати:"
echo "1) усім формам вашого прізвища   Супрун(а|у|ом|і|е)"
echo "2) усім формам вашого імені   Павл(о|а|у|ом|і|е)"
echo "3) усім телефонним кодам обласних центрів, де ***   0432[-\s]?\d{3}[-\s]?\d{2}[-\s]?\d{2}"

echo "4) Покажіть на екрані список усіх користувачів системи з оболонкою Bash   cat /etc/passwd | grep bash"
echo "5) Покажіть на екрані список усіх рядків, що починаються з 'daemon'   grep \"^daemon\" /etc/group"
echo "6) Покажіть усі рядки з того ж файлу, що не містять 'daemon'   grep -v \"daemon\" /etc/group"
echo "7) Яку кількість файлів містять ці підкаталоги, не враховуючи файли вигляду README.a_string?   find /etc -type f -name 'README' -not -name 'README.*' | wc -l"
echo "8) Покажіть список файлів у домашньому каталозі, що змінювалися менше, ніж 10 годин тому   find ~/ -type f -mmin -600"
